#เก็บข้อมูลของ User ให้ User ป้อนข้อมูล
item = str(input("Enter  your item! : "))
price = float(input("Enter the price! : "))
quantity = int(input("Enter the quantity! : "))

#สร้างตัวแปร คำนวณเงิน
# subtotal คือการเอา จำนวนของมาคูณกับราคาของเช่น ของราคา20บาท เอา2อันเป็น40
subtotal = price * quantity
#vat7% : 7% ในภาษาโค้ดเขียนเป็น 0.07 เราจะตั้งตัวแปรเป็น vat เอาที่เราคำนวณข้างบน มาคูณกับ 0.07
vat = subtotal * 0.07
#total คือ เอาราคาของ มาบวกกับ vat จะได้ total
total = subtotal + vat


#อันนี้ไม่ต้อง งง น้า อันนี้คือตั้งตัวแปรเฉยๆ
txt = "RECEIPT"


#(f"{txt:=^30}") จุดนี้ไม่ต้องสับสน อันนี้แค่จำ txt ที่ใส่ข้างในคือตัวแปรข้อความที่เราสร้างไว้ 

# ส่วน (:) ต้องตามหลัง ตัวแปร(txt) เสมอถ้าจะเอาข้อความแทรกตรงตัวขั้น // = คืออักษรที่เราจะให้คั่นให้ ปกติถ้าใส่ "="*5 : ===== // "-"*5 : -----

# (^)คือตัวบอกว่าจะให้ ข้อความอยู่ตรงกลาง ,(<) ข้อความทางซ้าย, (>) ข้อความทางขวา

# เลข30 คือให้มี จำนวนเท่ากับ กับ ตัวข้อความรวมกัน30ตัวเพื่อคั่นให้ดูสวยงาม เช่น txt = HELLO // (f"{txt:=^5}")=====HELLO=====
print(f"{txt:=^30}")

#อันนี้ใส่ตัวแปรปกติเยย ข้างบนคำนวณให้หมดแล้วว
print(f"{'Item':<10}: {item}")
#{price:.2f} คือ การลดทสนิยมให้เหลือ 2 ตำแหน่ง เช่น 67.67890 จะปัดขึ้นให้เป็น 67.68
print(f"{'Price':<10}: {price:.2f} Baht")
print(f"{'Quantity':<10}: {quantity}")
print("-" * 30)
print(f"{'Subtotal':<10}: {subtotal:.2f} Baht")
print(f"{'VAT 7%':<10}: {vat:.2f} Baht")
print(f"{'Total':<10}: {total:.2f} Baht")
print("=" * 30)  